const myArray = [
   ['John', 23],
   ['cat', 2],
]
/* 
1. Добавить ["dog", 3] в конец массива
2. Удалить последний элемент из массива
3. Добавить ["Paul", 35] в начало массива
4. Удалить первый элемент из массива
*/

const myList = []
/*
1. Добавить список покупок в формате [наименование, цена]
2. Формат данных массив из строки и числа
3. Добавите как минимум 5 элементов в список
4. Результатирующий массив должен быть многомерным
5. *Получите индекс 4-го элемента
6. *Получите цену 3-го элемента по индексу
*/

// * - со звездочкой
