/* 
    Создать столько переменных сколько типов данных
    Вывести значение и тип переменной в console.log
*/

/*
    Создать переменные a = 22 и b = 7. 
    Найти остаток от деления a на b, вывести в console.log

    * Переменные присваиваются через prompt
*/

/*
    Создать переменные x и y с рандомными числами. 
    Найти остаток от деления x на y
    Если остаток есть в console.log вывести 'Делится без остатка', иначе вывести 'Делится с остатком {остаток}'.

    - использовать Math https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Math
*/

/*
    Создать переменные e и f. 
    Отнять e от f, результат записать в g
    Сделать так, чтобы g было в любом случае положительным
    - использовать Math https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Math

    * Переменные присваиваются через prompt
*/

/*
    Вывести окно prompt с вопросом о имени
    Вывести окно prompt с вопросом о фамилии
    Вывести окно prompt с вопросом о возрасте
    Создать переменную, которая содержит строку вида 'Меня зовут LAST_NAME NAME, мне AGE лет/год'
    Вывести значение этой переменной в console.log или console.log
    Изменить значение переменной на любое другое
    Результат снова вывести в console.log
 */

/*
    Создать обьект {name: '', lastName: '', age: null}
    Вывести окно prompt с вопросом о имени
    Вывести окно prompt с вопросом о фамилии
    Вывести окно prompt с вопросом о возрасте
    Создать переменную, которая содержит строку вида 'Меня зовут lastName name, мне age лет/год'
*/

/*
    Вывести окно prompt с вопросом о возрасте
    В зависимости от ответа вывести console.log с текстом “поздравляем, вам X полных лет”
    Вывести окно console.log с утверждением совершеннолетний пользователь или нет
*/
